---
kind: type
id: T:Autodesk.Revit.DB.TessellatedShapeBuilderOutcome
source: html/d5cda534-1755-bd50-aafe-11143063a3e0.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderOutcome

Describes the outcome of TessellatedShapeBuilder attempt
 to build geometrical objects.

## Syntax (C#)
```csharp
public enum TessellatedShapeBuilderOutcome
```